export const questions = [
  {
    title: 'React - это ... ?',
    variants: ['библиотека', 'фреймворк', 'приложение'],
    correct: 0,
  },
  {
    title: 'Vue - это ... ?',
    variants: ['библиотека', 'фреймворк', 'приложение'],
    correct: 1,
  },
  {
    title: 'React рективный ... ?',
    variants: ['да', 'нет', 'конечно, как ракета'],
    correct: 1,
  },
  {
    title: 'Что возвращает Async ... ?',
    variants: ['Callback', 'Await', 'Promice'],
    correct: 2,
  },
  {
    title: 'Redux это  ... ?',
    variants: ['state manager', 'библиотека для React', 'такое я не использовал'],
    correct: 0,
  },
  {
    title: 'Компонент - это ... ',
    variants: ['приложение', 'часть приложения или страницы', 'то, что я не знаю что такое'],
    correct: 1,
  },
  {
    title: 'Что такое JSX?',
    variants: [
      'Это простой HTML',
      'Это функция',
      'Это тот же HTML, но с возможностью выполнять JS-код',
    ],
    correct: 2,
  },
  {
    title: 'Что такое Set?',
    variants: [
      'Коллекция уникальных значений',
      'Коллекция установленных значений',
      'Коллекция значений любого типа',
    ],
    correct: 0,
  },
  {
    title: 'Можно ли переназначить значение объекта объявленного через const?',
    variants: [
      'Нет, потому что const - константа',
      'Да',
      'Нет, потому что объект иммутабельный',
    ],
    correct: 1,
  },
  {
    title: 'Как создать объект с помощью Class?',
    variants: [
      'С помощью {}',
      'С помощью ключего слова New Class',
      'С помощью ключего слова New',
    ],
    correct: 2,
  },
];
